dmatking/esp32-idf-new/boards/cyd/cyd28s3_ili9341_touch/sdkconfig.defaults
# Target: ESP32-S3R8 (8MB OPI PSRAM, 16MB Flash)
CONFIG_IDF_TARGET="esp32s3"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# PSRAM — 8MB OPI (octal SPI)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_AUTO=y

# Console — board has no dedicated USB-UART IC; Type-C uses USB_SERIAL_JTAG
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# CPU
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# FreeRTOS tick rate
CONFIG_FREERTOS_HZ=1000
